app/controllers/users/registrations_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("role_id", "login", "created_at", "updated_at", "email", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"